//** @file
//     PCI Class Code Sting 
//
//;******************************************************************************
//;* Copyright (c) 2022, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************


#include "Standard.uni"

#string STR_NULL_STRING                   #language en-US "NULL"
#string STR_UNDEFINED_STRING              #language en-US "Undefined"

//
// PCI ClassCode Base Classes
//
#string STR_PCI_CLASS_BASE00_STRING       #language en-US "Unclassified device"
#string STR_PCI_CLASS_BASE01_STRING       #language en-US "Mass Storage Controller"
#string STR_PCI_CLASS_BASE02_STRING       #language en-US "Network Controller"
#string STR_PCI_CLASS_BASE03_STRING       #language en-US "Display Controller"
#string STR_PCI_CLASS_BASE04_STRING       #language en-US "Multimedia Device"
#string STR_PCI_CLASS_BASE05_STRING       #language en-US "Memory Controller"
#string STR_PCI_CLASS_BASE06_STRING       #language en-US "Bridge"
#string STR_PCI_CLASS_BASE07_STRING       #language en-US "Communication Controller"
#string STR_PCI_CLASS_BASE08_STRING       #language en-US "Generic System Peripheral"
#string STR_PCI_CLASS_BASE09_STRING       #language en-US "Input Device controller"
#string STR_PCI_CLASS_BASE0A_STRING       #language en-US "Docking Stations"
#string STR_PCI_CLASS_BASE0B_STRING       #language en-US "Processor"
#string STR_PCI_CLASS_BASE0C_STRING       #language en-US "Serial Bus Controller"
#string STR_PCI_CLASS_BASE0D_STRING       #language en-US "Wireless Controller"
#string STR_PCI_CLASS_BASE0E_STRING       #language en-US "Intelligent Controller"
#string STR_PCI_CLASS_BASE0F_STRING       #language en-US "Satellite Communications Controller"
#string STR_PCI_CLASS_BASE10_STRING       #language en-US "Encryption Controllers"
#string STR_PCI_CLASS_BASE11_STRING       #language en-US "Signal processing controller"
#string STR_PCI_CLASS_BASE12_STRING       #language en-US "Processing Accelerators"
#string STR_PCI_CLASS_BASE13_STRING       #language en-US "Non-Essential Instrumentation"
#string STR_PCI_CLASS_BASE40_STRING       #language en-US "Coprocessor"

//
// PCI ClassCode Sub Classes
//

//
// Sub class 00
//
  #string STR_PCI_CLASS_SUB0000_STRING    #language en-US "Non-VGA unclassified device"
  #string STR_PCI_CLASS_SUB0001_STRING    #language en-US "VGA-compatible devices"

//
// Sub class 01
//
  #string STR_PCI_CLASS_SUB0100_STRING    #language en-US "SCSI bus controller"
  #string STR_PCI_CLASS_SUB0101_STRING    #language en-US "IDE controller"
  #string STR_PCI_CLASS_SUB0102_STRING    #language en-US "Floppy disk controller"
  #string STR_PCI_CLASS_SUB0103_STRING    #language en-US "IPI bus controller"
  #string STR_PCI_CLASS_SUB0104_STRING    #language en-US "RAID controller"
  #string STR_PCI_CLASS_SUB0105_STRING    #language en-US "ATA controller"
  #string STR_PCI_CLASS_SUB0106_STRING    #language en-US "Serial ATA controller"
  #string STR_PCI_CLASS_SUB0107_STRING    #language en-US "Serial Attached SCSI (SAS) controller "
  #string STR_PCI_CLASS_SUB0108_STRING    #language en-US "Non-volatile memory subsystem"
  #string STR_PCI_CLASS_SUB0109_STRING    #language en-US "Universal Flash Storage controller"
  #string STR_PCI_CLASS_SUB0180_STRING    #language en-US "Other mass storage controller"

//
// Sub class 02
//
  #string STR_PCI_CLASS_SUB0200_STRING    #language en-US "Ethernet controller"
  #string STR_PCI_CLASS_SUB0201_STRING    #language en-US "Token ring controller"
  #string STR_PCI_CLASS_SUB0202_STRING    #language en-US "FDDI controller"
  #string STR_PCI_CLASS_SUB0203_STRING    #language en-US "ATM controller"
  #string STR_PCI_CLASS_SUB0204_STRING    #language en-US "ISDN controller"
  #string STR_PCI_CLASS_SUB0205_STRING    #language en-US "WorldFip controller"
  #string STR_PCI_CLASS_SUB0206_STRING    #language en-US "PICMG 2.14 Multi Computing"
  #string STR_PCI_CLASS_SUB0207_STRING    #language en-US "InfiniBand controller"
  #string STR_PCI_CLASS_SUB0208_STRING    #language en-US "Host fabric controller"
  #string STR_PCI_CLASS_SUB0280_STRING    #language en-US "Other network controller"

//
// Sub class 03
//
  #string STR_PCI_CLASS_SUB0300_STRING    #language en-US "VGA controller"
  #string STR_PCI_CLASS_SUB0301_STRING    #language en-US "XGA controller"
  #string STR_PCI_CLASS_SUB0302_STRING    #language en-US "3D controller"
  #string STR_PCI_CLASS_SUB0380_STRING    #language en-US "Other display controller"

//
// Sub class 04
//
  #string STR_PCI_CLASS_SUB0400_STRING    #language en-US "Video device"
  #string STR_PCI_CLASS_SUB0401_STRING    #language en-US "Audio device"
  #string STR_PCI_CLASS_SUB0402_STRING    #language en-US "Computer Telephony device"
  #string STR_PCI_CLASS_SUB0403_STRING    #language en-US "Mixed mode device"
  #string STR_PCI_CLASS_SUB0480_STRING    #language en-US "Other multimedia device"

//
// Sub class 05
//
  #string STR_PCI_CLASS_SUB0500_STRING    #language en-US "RAM memory controller"
  #string STR_PCI_CLASS_SUB0501_STRING    #language en-US "Flash memory controller"
  #string STR_PCI_CLASS_SUB0580_STRING    #language en-US "Other memory controller"

//
// Sub class 06
//
  #string STR_PCI_CLASS_SUB0600_STRING    #language en-US "Host/PCI bridge"
  #string STR_PCI_CLASS_SUB0601_STRING    #language en-US "PCI/ISA bridge"
  #string STR_PCI_CLASS_SUB0602_STRING    #language en-US "PCI/EISA bridge"
  #string STR_PCI_CLASS_SUB0603_STRING    #language en-US "PCI/Micro Channel bridge"
  #string STR_PCI_CLASS_SUB0604_STRING    #language en-US "PCI/PCI bridge"
  #string STR_PCI_CLASS_SUB0605_STRING    #language en-US "PCI/PCMCIA bridge"
  #string STR_PCI_CLASS_SUB0606_STRING    #language en-US "NuBus bridge"
  #string STR_PCI_CLASS_SUB0607_STRING    #language en-US "CardBus bridge"
  #string STR_PCI_CLASS_SUB0608_STRING    #language en-US "RACEway bridge"
  #string STR_PCI_CLASS_SUB0609_STRING    #language en-US "Semi-transparent PCI-to-PCI bridge"
  #string STR_PCI_CLASS_SUB060A_STRING    #language en-US "InfiniBand-to-PCI host bridge"
  #string STR_PCI_CLASS_SUB060B_STRING    #language en-US "Advanced Switching to PCI host bridge"
  #string STR_PCI_CLASS_SUB0680_STRING    #language en-US "Other bridge type"

//
// Sub class 07
//
  #string STR_PCI_CLASS_SUB0700_STRING    #language en-US "Serial controller"
  #string STR_PCI_CLASS_SUB0701_STRING    #language en-US "Parallel port"
  #string STR_PCI_CLASS_SUB0702_STRING    #language en-US "Multiport serial controller"
  #string STR_PCI_CLASS_SUB0703_STRING    #language en-US "Modem"
  #string STR_PCI_CLASS_SUB0704_STRING    #language en-US "GPIB (IEEE 488.1/2) controller"
  #string STR_PCI_CLASS_SUB0705_STRING    #language en-US "Smart Card"
  #string STR_PCI_CLASS_SUB0780_STRING    #language en-US "Other communication device"

//
// Sub class 08
//
  #string STR_PCI_CLASS_SUB0800_STRING    #language en-US "PIC"
  #string STR_PCI_CLASS_SUB0801_STRING    #language en-US "DMA controller"
  #string STR_PCI_CLASS_SUB0802_STRING    #language en-US "System timer"
  #string STR_PCI_CLASS_SUB0803_STRING    #language en-US "RTC controller"
  #string STR_PCI_CLASS_SUB0804_STRING    #language en-US "Generic PCI Hot-Plug controller"
  #string STR_PCI_CLASS_SUB0805_STRING    #language en-US "SD Host controller"
  #string STR_PCI_CLASS_SUB0806_STRING    #language en-US "IOMMU"
  #string STR_PCI_CLASS_SUB0807_STRING    #language en-US "Root Complex Event Collector"
  #string STR_PCI_CLASS_SUB0880_STRING    #language en-US "Other system peripheral"

//
// Sub class 09
//
  #string STR_PCI_CLASS_SUB0900_STRING    #language en-US "Keyboard controller"
  #string STR_PCI_CLASS_SUB0901_STRING    #language en-US "Digitizer (pen)"
  #string STR_PCI_CLASS_SUB0902_STRING    #language en-US "Mouse controller"
  #string STR_PCI_CLASS_SUB0903_STRING    #language en-US "Scanner controller"
  #string STR_PCI_CLASS_SUB0904_STRING    #language en-US "Gameport controller"
  #string STR_PCI_CLASS_SUB0980_STRING    #language en-US "Other input controller"

//
// Sub class 0a
//
  #string STR_PCI_CLASS_SUB0A00_STRING    #language en-US "Generic docking station"
  #string STR_PCI_CLASS_SUB0A80_STRING    #language en-US "Other type of docking station"

//
// Sub class 0b
//
  #string STR_PCI_CLASS_SUB0B00_STRING    #language en-US "386"
  #string STR_PCI_CLASS_SUB0B01_STRING    #language en-US "486"
  #string STR_PCI_CLASS_SUB0B02_STRING    #language en-US "Pentium"
  #string STR_PCI_CLASS_SUB0B10_STRING    #language en-US "Alpha"
  #string STR_PCI_CLASS_SUB0B20_STRING    #language en-US "PowerPC"
  #string STR_PCI_CLASS_SUB0B30_STRING    #language en-US "MIPS"
  #string STR_PCI_CLASS_SUB0B40_STRING    #language en-US "Co-processor"
  #string STR_PCI_CLASS_SUB0B80_STRING    #language en-US "Other processor"

//
// Sub class 0c
//
  #string STR_PCI_CLASS_SUB0C00_STRING    #language en-US "IEEE 1394"
  #string STR_PCI_CLASS_SUB0C01_STRING    #language en-US "ACCESS.bus"
  #string STR_PCI_CLASS_SUB0C02_STRING    #language en-US "SSA"
  #string STR_PCI_CLASS_SUB0C03_STRING    #language en-US "USB controller"
  #string STR_PCI_CLASS_SUB0C04_STRING    #language en-US "Fibre Channel",
  #string STR_PCI_CLASS_SUB0C05_STRING    #language en-US "System Management Bus"
  #string STR_PCI_CLASS_SUB0C06_STRING    #language en-US "InfiniBand"
  #string STR_PCI_CLASS_SUB0C07_STRING    #language en-US "IPMI Interface"
  #string STR_PCI_CLASS_SUB0C08_STRING    #language en-US "SERCOS Interface Standard (IEC 61491)"
  #string STR_PCI_CLASS_SUB0C09_STRING    #language en-US "CANbus"
  #string STR_PCI_CLASS_SUB0C0A_STRING    #language en-US "MIPI I3C Host Controller Interface"
  #string STR_PCI_CLASS_SUB0C80_STRING    #language en-US "Other bus type"

//
// Sub class 0d
//
  #string STR_PCI_CLASS_SUB0D00_STRING    #language en-US "iRDA compatible controller"
  #string STR_PCI_CLASS_SUB0D01_STRING    #language en-US "Consumer IR controller"
  #string STR_PCI_CLASS_SUB0D10_STRING    #language en-US "RF controller"
  #string STR_PCI_CLASS_SUB0D11_STRING    #language en-US "Bluetooth"
  #string STR_PCI_CLASS_SUB0D12_STRING    #language en-US "Broadband"
  #string STR_PCI_CLASS_SUB0D20_STRING    #language en-US "Ethernet (802.11a - 5 GHz)"
  #string STR_PCI_CLASS_SUB0D21_STRING    #language en-US "Ethernet (802.11b - 2.4 GHz)"
  #string STR_PCI_CLASS_SUB0D40_STRING    #language en-US "Cellular controller/modem"
  #string STR_PCI_CLASS_SUB0D41_STRING    #language en-US "Cellular controller/modem plus Ethernet (802.11)"
  #string STR_PCI_CLASS_SUB0D80_STRING    #language en-US "Other type of wireless controller"

//
// Sub class 0e
//
  #string STR_PCI_CLASS_SUB0E00_STRING    #language en-US "I2O Architecture"

//
// Sub class 0f
//
  #string STR_PCI_CLASS_SUB0F01_STRING    #language en-US "TV"
  #string STR_PCI_CLASS_SUB0F02_STRING    #language en-US "Audio"
  #string STR_PCI_CLASS_SUB0F03_STRING    #language en-US "Voice"
  #string STR_PCI_CLASS_SUB0F04_STRING    #language en-US "Data"
  #string STR_PCI_CLASS_SUB0F80_STRING    #language en-US "Other satellite communication controller"

//
// Sub class 10
//
  #string STR_PCI_CLASS_SUB1000_STRING    #language en-US "Network & computing Encrypt/Decrypt"
  #string STR_PCI_CLASS_SUB1010_STRING    #language en-US "Entertainment Encrypt/Decrypt"
  #string STR_PCI_CLASS_SUB1080_STRING    #language en-US "Other Encrypt/Decrypt"

//
// Sub class 11
//
  #string STR_PCI_CLASS_SUB1100_STRING    #language en-US "DPIO modules"
  #string STR_PCI_CLASS_SUB1101_STRING    #language en-US "Performance Counters"
  #string STR_PCI_CLASS_SUB1110_STRING    #language en-US "Communications synchronization plus time and frequency test/measurement "
  #string STR_PCI_CLASS_SUB1120_STRING    #language en-US "Management card"
  #string STR_PCI_CLASS_SUB1180_STRING    #language en-US "Other DAQ & SP controllers"

//
// Sub class 12
//
  #string STR_PCI_CLASS_SUB1200_STRING    #language en-US "Processing Accelerator"

//
// Sub class 13
//
  #string STR_PCI_CLASS_SUB1300_STRING    #language en-US "Non-Essential Instrumentation Function"

//
// Sub class 40
//
  #string STR_PCI_CLASS_SUB4000_STRING    #language en-US "Coprocessor"

//
// PCI ClassCode Programming Interface
//

//
// PIF class 0100
//
  #string STR_PCI_CLASS_PIF010000_STRING  #language en-US "SCSI controller"
  #string STR_PCI_CLASS_PIF010011_STRING  #language en-US "SCSI storage device SOP using PQI"
  #string STR_PCI_CLASS_PIF010012_STRING  #language en-US "SCSI controller SOP using PQI"
  #string STR_PCI_CLASS_PIF010013_STRING  #language en-US "SCSI storage device and controller SOP using PQI"
  #string STR_PCI_CLASS_PIF010021_STRING  #language en-US "SCSI storage device SOP using NVMe"

//
// PIF class 0101
//
  #string STR_PCI_CLASS_PIF010100_STRING  #language en-US "ISA Compatibility mode-only controller"
  #string STR_PCI_CLASS_PIF010101_STRING  #language en-US "OM-primary"
  #string STR_PCI_CLASS_PIF010102_STRING  #language en-US "PI-primary"
  #string STR_PCI_CLASS_PIF010103_STRING  #language en-US "OM/PI-primary"
  #string STR_PCI_CLASS_PIF010104_STRING  #language en-US "OM-secondary"
  #string STR_PCI_CLASS_PIF010105_STRING  #language en-US "PCI native mode-only controller"
  #string STR_PCI_CLASS_PIF010106_STRING  #language en-US "PI-primary, OM-secondary"
  #string STR_PCI_CLASS_PIF010107_STRING  #language en-US "OM/PI-primary, OM-secondary"
  #string STR_PCI_CLASS_PIF010108_STRING  #language en-US "OM-secondary"
  #string STR_PCI_CLASS_PIF010109_STRING  #language en-US "OM-primary, PI-secondary"
  #string STR_PCI_CLASS_PIF01010A_STRING  #language en-US "ISA Compatibility mode controller"
  #string STR_PCI_CLASS_PIF01010B_STRING  #language en-US "OM/PI-primary, PI-secondary"
  #string STR_PCI_CLASS_PIF01010C_STRING  #language en-US "OM-secondary"
  #string STR_PCI_CLASS_PIF01010D_STRING  #language en-US "OM-primary, OM/PI-secondary"
  #string STR_PCI_CLASS_PIF01010E_STRING  #language en-US "PI-primary, OM/PI-secondary"
  #string STR_PCI_CLASS_PIF01010F_STRING  #language en-US "PCI native mode controller"
  #string STR_PCI_CLASS_PIF010180_STRING  #language en-US "ISA Compatibility mode-only controller"
  #string STR_PCI_CLASS_PIF010181_STRING  #language en-US "Master, OM-primary"
  #string STR_PCI_CLASS_PIF010182_STRING  #language en-US "Master, PI-primary"
  #string STR_PCI_CLASS_PIF010183_STRING  #language en-US "Master, OM/PI-primary"
  #string STR_PCI_CLASS_PIF010184_STRING  #language en-US "Master, OM-secondary"
  #string STR_PCI_CLASS_PIF010185_STRING  #language en-US "PCI native mode-only controller"
  #string STR_PCI_CLASS_PIF010186_STRING  #language en-US "Master, PI-primary, OM-secondary"
  #string STR_PCI_CLASS_PIF010187_STRING  #language en-US "Master, OM/PI-primary, OM-secondary"
  #string STR_PCI_CLASS_PIF010188_STRING  #language en-US "Master, OM-secondary"
  #string STR_PCI_CLASS_PIF010189_STRING  #language en-US "Master, OM-primary, PI-secondary"
  #string STR_PCI_CLASS_PIF01018A_STRING  #language en-US "ISA Compatibility mode controller"
  #string STR_PCI_CLASS_PIF01018B_STRING  #language en-US "Master, OM/PI-primary, PI-secondary"
  #string STR_PCI_CLASS_PIF01018C_STRING  #language en-US "Master, OM-secondary"
  #string STR_PCI_CLASS_PIF01018D_STRING  #language en-US "Master, OM-primary, OM/PI-secondary"
  #string STR_PCI_CLASS_PIF01018E_STRING  #language en-US "Master, PI-primary, OM/PI-secondary"
  #string STR_PCI_CLASS_PIF01018F_STRING  #language en-US "PCI native mode controller"

//
// PIF class 0105
//
  #string STR_PCI_CLASS_PIF010520_STRING  #language en-US "Single stepping"
  #string STR_PCI_CLASS_PIF010530_STRING  #language en-US "Continuous operation"

//
// PIF class 0106
//
  #string STR_PCI_CLASS_PIF010600_STRING  #language en-US "Vendor specific"
  #string STR_PCI_CLASS_PIF010601_STRING  #language en-US "AHCI"
  #string STR_PCI_CLASS_PIF010602_STRING  #language en-US "Serial Storage Bus"

//
// PIF class 0107
//
  #string STR_PCI_CLASS_PIF010700_STRING  #language en-US "SAS controller"
  #string STR_PCI_CLASS_PIF010701_STRING  #language en-US "Serial Storage Bus"

//
// PIF class 0108
//
  #string STR_PCI_CLASS_PIF010800_STRING  #language en-US "NVM Vendor-specific"
  #string STR_PCI_CLASS_PIF010801_STRING  #language en-US "NVMHCI"
  #string STR_PCI_CLASS_PIF010802_STRING  #language en-US "NVM Express I/O controller"
  #string STR_PCI_CLASS_PIF010803_STRING  #language en-US "NVM Express administrative controller"

//
// PIF class 0109
//
  #string STR_PCI_CLASS_PIF010900_STRING  #language en-US "UFS Vendor-specific"
  #string STR_PCI_CLASS_PIF010901_STRING  #language en-US "UFSHCI"

//
// PIF class 0300
//
  #string STR_PCI_CLASS_PIF030000_STRING  #language en-US "VGA controller"
  #string STR_PCI_CLASS_PIF030001_STRING  #language en-US "8514 controller"

//
// PIF class 0300
//
  #string STR_PCI_CLASS_PIF040300_STRING  #language en-US "HD-A 1.0 compatible"
  #string STR_PCI_CLASS_PIF040380_STRING  #language en-US "HD-A 1.0 compatible with vendor-specific"

//
// PIF class 0604
//
  #string STR_PCI_CLASS_PIF060400_STRING  #language en-US "Normal decode"
  #string STR_PCI_CLASS_PIF060401_STRING  #language en-US "Subtractive decode"

//
// PIF class 0609
//
  #string STR_PCI_CLASS_PIF060800_STRING  #language en-US "Transparent mode"
  #string STR_PCI_CLASS_PIF060801_STRING  #language en-US "End-point mode"


//
// PIF class 0609
//
  #string STR_PCI_CLASS_PIF060940_STRING  #language en-US "Primary PCI bus side facing the system host processor"
  #string STR_PCI_CLASS_PIF060980_STRING  #language en-US "Secondary PCI bus side facing the system host processor"

//
// PIF class 060b
//
  #string STR_PCI_CLASS_PIF060B00_STRING  #language en-US "Custom"
  #string STR_PCI_CLASS_PIF060B01_STRING  #language en-US "ASI-SIG Defined Portal"

//
// PIF class 0700
//
  #string STR_PCI_CLASS_PIF070000_STRING  #language en-US "Generic XT-compatible"
  #string STR_PCI_CLASS_PIF070001_STRING  #language en-US "16450-compatible"
  #string STR_PCI_CLASS_PIF070002_STRING  #language en-US "16550-compatible"
  #string STR_PCI_CLASS_PIF070003_STRING  #language en-US "16650-compatible"
  #string STR_PCI_CLASS_PIF070004_STRING  #language en-US "16750-compatible"
  #string STR_PCI_CLASS_PIF070005_STRING  #language en-US "16850-compatible"
  #string STR_PCI_CLASS_PIF070006_STRING  #language en-US "16950-compatible"

//
// PIF class 0701
//
  #string STR_PCI_CLASS_PIF070100_STRING  #language en-US "SPP"
  #string STR_PCI_CLASS_PIF070101_STRING  #language en-US "Bi-directional"
  #string STR_PCI_CLASS_PIF070102_STRING  #language en-US "ECP 1.X-compliant"
  #string STR_PCI_CLASS_PIF070103_STRING  #language en-US "IEEE 1284"
  #string STR_PCI_CLASS_PIF0701FE_STRING  #language en-US "IEEE 1284 target (not a controller)"

//
// PIF class 0703
//
  #string STR_PCI_CLASS_PIF070300_STRING  #language en-US "Generic"
  #string STR_PCI_CLASS_PIF070301_STRING  #language en-US "Hayes-compatible 16450"
  #string STR_PCI_CLASS_PIF070302_STRING  #language en-US "Hayes-compatible 16550"
  #string STR_PCI_CLASS_PIF070303_STRING  #language en-US "Hayes-compatible 16650"
  #string STR_PCI_CLASS_PIF070304_STRING  #language en-US "Hayes-compatible 16750"

//
// PIF class 0800
//
  #string STR_PCI_CLASS_PIF080000_STRING  #language en-US "Generic 8259"
  #string STR_PCI_CLASS_PIF080001_STRING  #language en-US "ISA"
  #string STR_PCI_CLASS_PIF080002_STRING  #language en-US "EISA"
  #string STR_PCI_CLASS_PIF080010_STRING  #language en-US "IO APIC"
  #string STR_PCI_CLASS_PIF080020_STRING  #language en-US "IO(x) APIC interrupt controller"

//
// PIF class 0801
//
  #string STR_PCI_CLASS_PIF080100_STRING  #language en-US "Generic 8237"
  #string STR_PCI_CLASS_PIF080101_STRING  #language en-US "ISA"
  #string STR_PCI_CLASS_PIF080102_STRING  #language en-US "EISA"

//
// PIF class 0802
//
  #string STR_PCI_CLASS_PIF080200_STRING  #language en-US "Generic 8254"
  #string STR_PCI_CLASS_PIF080201_STRING  #language en-US "ISA"
  #string STR_PCI_CLASS_PIF080202_STRING  #language en-US "EISA"
  #string STR_PCI_CLASS_PIF080203_STRING  #language en-US "HPET"

//
// PIF class 0803
//
  #string STR_PCI_CLASS_PIF080300_STRING  #language en-US "Generic"
  #string STR_PCI_CLASS_PIF080301_STRING  #language en-US "ISA"
  #string STR_PCI_CLASS_PIF080302_STRING  #language en-US "EISA"

//
// PIF class 0904
//
  #string STR_PCI_CLASS_PIF090400_STRING  #language en-US "Generic"
  #string STR_PCI_CLASS_PIF090410_STRING  #language en-US "Extended"

//
// PIF class 0c00
//
  #string STR_PCI_CLASS_PIF0C0000_STRING  #language en-US "Generic"
  #string STR_PCI_CLASS_PIF0C0010_STRING  #language en-US "OHCI"

//
// PIF class 0c03
//
  #string STR_PCI_CLASS_PIF0C0300_STRING  #language en-US "UHCI"
  #string STR_PCI_CLASS_PIF0C0310_STRING  #language en-US "OHCI"
  #string STR_PCI_CLASS_PIF0C0320_STRING  #language en-US "EHCI"
  #string STR_PCI_CLASS_PIF0C0330_STRING  #language en-US "XHCI"
  #string STR_PCI_CLASS_PIF0C0340_STRING  #language en-US "USB4 Host Interface"
  #string STR_PCI_CLASS_PIF0C0380_STRING  #language en-US "No specific programming interface"
  #string STR_PCI_CLASS_PIF0C03FE_STRING  #language en-US "USB Device"

//
// PIF class 0c07
//
  #string STR_PCI_CLASS_PIF0C0700_STRING  #language en-US "SMIC"
  #string STR_PCI_CLASS_PIF0C0701_STRING  #language en-US "Keyboard Controller Style"
  #string STR_PCI_CLASS_PIF0C0702_STRING  #language en-US "Block Transfer"

//
// PIF class 0d01
//
  #string STR_PCI_CLASS_PIF0D0100_STRING  #language en-US "Consumer IR controller"
  #string STR_PCI_CLASS_PIF0D0110_STRING  #language en-US "UWB Radio controller"

//
// PIF class 0e00
//
  #string STR_PCI_CLASS_PIF0E0000_STRING  #language en-US "Message FIFO at offset 40h"
